In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

/Users/hassan/.pyenv/versions/3.6.5/envs/pandas/lib/python3.6/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [3]:
df = pd.DataFrame(people)

In [4]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

# Updating column names

In [10]:
df.columns = ['First_name', 'Last_name', 'email']

In [11]:
df

  First_name Last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
df.columns = [x.upper() for x in df.columns]

In [14]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [17]:
df.columns = df.columns.str.replace('_', ' ')

In [18]:
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [19]:
df.columns = [x.lower() for x in df.columns]
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [21]:
df.rename(columns={'first name': 'first', 'last name': 'last'}, inplace=True)

In [22]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [24]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [25]:
df.loc[2] = ['John', 'Smith', 'Johnsmith@gmail.com']

In [26]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      Johnsmith@gmail.com

In [29]:
df.loc[2, ['first','last', 'email']] = ['John', 'Doe', 'JohnDoe@gmail.com']

In [30]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@gmail.com

In [32]:
df.loc[2, 'last'] = 'Smith'

In [33]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@gmail.com

In [34]:
df.at[2, 'last'] = 'Doe'

In [35]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@gmail.com

In [38]:
filt3 = df['email'] == 'JohnDoe@gmail.com'
df[filt3]['last'] = 'Smith'

/Users/hassan/.pyenv/versions/3.6.5/envs/pandas/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [39]:
df.loc[filt3, 'last'] = 'Smith'

In [40]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@gmail.com

In [43]:
df['email'] = df['email'].str.lower()

In [44]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@gmail.com

In [45]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [46]:
def update_email(email):
    return email.upper()

In [47]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [48]:
df['email'] = df['email'].apply(update_email)

In [49]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [51]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@gmail.com

In [53]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [54]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

# Lambda works only on series

In [56]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

# apply works for series and applemap works on dataframe

In [58]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [61]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@gmail.com

In [62]:
df['first'].map({'Corey': 'Hassan', 'Jane': 'Ali'})

0    Hassan
1       Ali
2       NaN
Name: first, dtype: object

In [63]:
df['first'] = df['first'].replace({'Corey': 'Hassan', 'Jane': 'Ali'})

In [64]:
df

    first     last                    email
0  Hassan  Schafer  coreymschafer@gmail.com
1     Ali      Doe        janedoe@email.com
2    John    Smith        johndoe@gmail.com